In [2]:
import pandas as pd # importa a biblioteca pandas

In [4]:
Dicionario_01={
    'Data': ["2023-01-01", "2023-01-02", "2023-01-03"],
    'Produto': ["Item A", "Item B","Item A"], 
    'Quantidade Valor': [10,5, 8], 
    'Valor':[100.00, 50.00, 80.00 ]
    
}
Dicionario_02={
    'Data':["2023-02-01","2023-02-02","2023-02-03"],
    'Produto':["Item C","Item B","Item D"],
    'Quantidade':[ 12,6,3 ],
    'Valor':[120.00,60.00,30.00]
}

In [6]:
df1 = pd.DataFrame(Dicionario_01)
df2 = pd.DataFrame(Dicionario_02)

In [8]:
df1.head()

         Data Produto  Quantidade Valor  Valor
0  2023-01-01  Item A                10  100.0
1  2023-01-02  Item B                 5   50.0
2  2023-01-03  Item A                 8   80.0

In [9]:
df2.head()

         Data Produto  Quantidade  Valor
0  2023-02-01  Item C          12  120.0
1  2023-02-02  Item B           6   60.0
2  2023-02-03  Item D           3   30.0